УчетВУправляющихДляГит1/src/Catalogs/ПрочиеДоходыИРасходы/ПрочиеДоходыИРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрочиеДоходыИРасходы</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВозвратТоваровПрошлыхЛет</name>
      <description>Возврат товаров, реализованных в прошлых налоговых периодах</description>
    </items>
    <items>
      <name>ВосстановлениеАмортизационнойПремии</name>
      <description>Восстановление амортизационной премии</description>
    </items>
    <items>
      <name>ДоходыПоАвансамПрошлогоНалоговогоПериодаИП</name>
      <description>Доходы по авансам полученным от покупателей в прошлом налоговом периоде (ИП)</description>
    </items>
    <items>
      <name>ИсправительныеЗаписиПоОперациямПрошлыхЛет</name>
      <description>Исправительные записи по операциям прошлых лет</description>
    </items>
    <items>
      <name>КомпенсацияЗаЗадержкуЗарплаты</name>
      <description>Компенсация за задержку зарплаты</description>
    </items>
    <items>
      <name>КурсовыеРазницы</name>
      <description>Курсовые разницы</description>
    </items>
    <items>
      <name>КурсовыеРазницыПоРасчетамВУЕ</name>
      <description>Курсовые разницы по расчетам в у.е. (по сделкам до 2015 г)</description>
    </items>
    <items>
      <name>ОприходованиеИзлишков</name>
      <description>Оприходование излишков</description>
    </items>
    <items>
      <name>ОтклонениеКурсаПродажиПокупкиВалюты</name>
      <description>Отклонения курса продажи (покупки) иностранной валюты от официального курса</description>
    </items>
    <items>
      <name>ДоходыРасходыПриПродажеПокупкеВалюты</name>
      <description>Продажа (покупка) иностранной валюты</description>
    </items>
    <items>
      <name>ПроцентыПоЗаймамСотрудникам</name>
      <description>Проценты по займам сотрудникам</description>
    </items>
    <items>
      <name>ПрочиеВнереализационныеДоходыРасходы</name>
      <description>Прочие внереализационные доходы и расходы</description>
    </items>
    <items>
      <name>РазницыЗалоговойИФактическойСтоимостиТары</name>
      <description>Разницы залоговой и фактической стоимости тары</description>
    </items>
    <items>
      <name>РазницыСтоимостиВозвратаИФактическойСтоимостиТоваров</name>
      <description>Разницы стоимости возврата и фактической стоимости товаров</description>
    </items>
    <items>
      <name>РасходыНаУслугиБанков</name>
      <description>Расходы на услуги банков</description>
    </items>
    <items>
      <name>РасходыНаУслугиФакторинговыхКомпаний</name>
      <description>Расходы на услуги факторинговых компаний</description>
    </items>
    <items>
      <name>РасходыОбслуживающихПроизводствИХозяйств</name>
      <description>Расходы обслуживающих производств и хозяйств</description>
    </items>
    <items>
      <name>РасходыПоБезвозмезднойПередаче</name>
      <description>Расходы по передаче товаров (работ, услуг) безвозмездно </description>
    </items>
    <items>
      <name>РасходыПоУплатеСтраховыхВзносов</name>
      <description>Расходы по уплате страховых взносов</description>
    </items>
    <items>
      <name>РасходыПоУплатеСтраховыхВзносовИП</name>
      <description>Расходы по уплате страховых взносов ИП (за себя)</description>
    </items>
    <items>
      <name>РеализацияОсновныхСредств</name>
      <description>Реализация основных средств</description>
    </items>
    <items>
      <name>РеализацияПрочегоИмущества</name>
      <description>Реализация прочего имущества</description>
    </items>
    <items>
      <name>РезервыПоСомнительнымДолгам</name>
      <description>Резервы по сомнительным долгам</description>
    </items>
    <items>
      <name>СписаниеВыделенногоНДСНаПрочиеРасходы</name>
      <description>Списание выделенного НДС на прочие расходы</description>
    </items>
    <items>
      <name>СписаниеНДСНаПрочиеРасходы</name>
      <description>Списание НДС на прочие расходы при переходе на УСН</description>
    </items>
    <items>
      <name>СуммовыеРазницы</name>
      <description>Суммовые разницы (налоговый учет) (по сделкам до 2015 г)</description>
    </items>
    <items>
      <name>УступкаПраваТребованияПоДоговоруФакторинга</name>
      <description>Уступка права требования по договору факторинга</description>
    </items>
    <items>
      <name>ШтрафыПениНеустойки</name>
      <description>Штрафы, пени и неустойки к получению</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидПрочихДоходовИРасходов</name>
    <type>
      <types>EnumRef.ВидыПрочихДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиДляНалоговогоУчетаЗатрат</name>
    <type>
      <types>EnumRef.ВидыДеятельностиДляНалоговогоУчетаЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятиеКналоговомуУчету</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Enums/ВидыДеятельностиДляНалоговогоУчетаЗатрат/ВидыДеятельностиДляНалоговогоУчетаЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДеятельностиДляНалоговогоУчетаЗатрат</name>
  <enumValues>
    <name>ОсновнаяСистемаНалогообложения</name>
  </enumValues>
  <enumValues>
    <name>ОсобыйПорядокНалогообложения</name>
  </enumValues>
  <enumValues>
    <name>РаспределяемыеЗатраты</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Catalogs/ПрочиеДоходыИРасходы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПринятиеКналоговомуУчету") Тогда
		ПринятиеКналоговомуУчету = ДанныеЗаполнения.ПринятиеКналоговомуУчету;
	Иначе
		ПринятиеКналоговомуУчету = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ЭтоНУ = НЕ ЭтоГруппа
		И (ВидДеятельностиДляНалоговогоУчетаЗатрат = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения
			ИЛИ ВидДеятельностиДляНалоговогоУчетаЗатрат = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты);
			
	Если НЕ ЭтоНУ Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ВидПрочихДоходовИРасходов");
        
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Не ЭтоГруппа И Не ЗначениеЗаполнено(ВидДеятельностиДляНалоговогоУчетаЗатрат) Тогда
		ВидДеятельностиДляНалоговогоУчетаЗатрат = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
